Revit 2027 API
PanelScheduleView.GetTemplate Method
 Gets the template for this view (to set the template, you must go through generateInstanceFromTemplate)
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetTemplate()
Public Function GetTemplate As ElementId
public:
ElementId^ GetTemplate()
member GetTemplate : unit -> ElementId
Return Value
ElementId
 The template id for this view
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace